cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "eddieantonio/eddieantonio"
tap "universal-ctags/universal-ctags"
tap "PotatoLabs/homebrew-git-redate"

brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "libjpg"
brew "zlib"
brew "readline"
brew "libxslt"
brew "libtool"
brew "gpg"
brew "rbenv"
brew "ruby-build"
brew "jenv"
brew "fzf"
brew "prototool"
brew "n"
brew "wget"
brew "html-xml-utils"

# CLI utilities
brew "tidy-html5"
brew "lnav"
brew "scc"

# Ranger utiities
brew "trash"
brew "libcaca"
brew "highlight"
brew "atool"
brew "mediainfo"
brew "exiftool"

brew "mas"
brew "tmux"
brew "imagemagick"
brew "ripgrep"
brew "stow"
brew "zsh-completions"
brew "tree"
brew "htop"
brew "watch"
brew "vnstat"
brew "p7zip"
brew "irssi"
brew "git-redate"

cask "spectacle"
cask "alfred"
cask "caprine"
cask "karabiner-elements"

# Utility/planning etc.
brew "gnuplot"
brew "tig"
brew "task"
brew "tasksh"
brew "timewarrior"

# vcs
tap "jesseduffield/lazygit"
brew "lazygit"

# Editors
brew "vim", args: ["with-python3"]
brew "neovim", args: ['HEAD']
brew "editorconfig"
cask "font-hack-nerd-font"
cask "sublime-text"
cask "kitty"

# Development
brew "python3"
brew "awscli"
brew "kubernetes-cli"
brew "postgresql"
cask "docker"

# Security
cask "lulu"
cask "blockblock"
cask "knockknock"
cask "appcleaner"

# Quick look
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "qlimagesize"

# App store
mas "1Password", id: 443987910
mas "OmnitOutline", id: 1142578772
mas "Amphetamine", id: 937984704
mas "Telegram Lite", id: 946399090
mas "The Unarchiver", id: 425424353
mas "Monit", id: 1014850245
mas "Markoff", id: 1084713122
