cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/fonts"
tap "eddieantonio/eddieantonio"
tap "dart-lang/dart"

brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "libjpg"
brew "zlib"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "gpg"
brew "go"
brew "nvm"
brew "rbenv"

# Ranger utiities
brew "trash"
brew "libcaca"
brew "highlight"
brew "atool"
brew "lynx"
brew "w3m"
brew "elinks"
brew "poppler"
brew "transmission"
brew "mediainfo"
brew "exiftool"

brew "mas"
brew "tmux"
brew "imag7magick"
brew "the_silver_searcher"
brew "stow"
brew "zsh"
brew "zsh-completions"
brew "tree"
brew "htop"
brew "watch"
brew "vnstat"
brew "swiftlint"
brew "p7zip"
brew "grv"
brew "irssi"

cask "deluge"
cask "spectacle"
cask "iterm2"
cask "alfred"
cask "caprine"
cask "thunderbird"
cask "google-chrome"

# Editors
brew "vim", args: ["with-python3"]
brew "editorconfig"
cask "font-hack-nerd-font"
cask "sublime-text"


# Development
#brew "python"
brew "python3"
brew "awscli"
brew "kubernetes-cli"
brew "postgresql"
brew "dart"
cask "docker"
cask "minikube"

# Java
brew "jabba"
cask "java"
cask "ant"
cask "maven"
cask "gradle"

# Flutter
brew "usbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "ios-deploy"
brew "cocoapods"

# Android
cask "android-sdk"
cask "android-ndk"




# Security
cask "lulu"
cask "blockblock"
cask "knockknock"
cask "appcleaner"

# Quick look
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "qlimagesize"

# App store
mas "1Password", id: 443987910
mas "Slack", id: 803453959
mas "OmnitOutline", id: 1142578772
mas "OmniFocus", id: 867299399
mas "Amphetamine", id: 937984704
mas "Telegram Desktop", id: 946399090
mas "The Unarchiver", id: 425424353
mas "TweetDeck", id: 485812721
mas "Monit", id: 1014850245
mas "Markoff", id: 1084713122
