cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/fonts"

brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "gpg"

brew "mas"
brew "tmux"
brew "asdf"
brew "imagemagick"
brew "the_silver_searcher"
brew "stow"
brew "python"
brew "python3"
brew "zsh"
brew "zsh-completions"
brew "tree"
brew "htop"
brew "watch"
brew "vnstat"
brew "vim", args: ["with-python3"]
brew "editorconfig"
brew "swiftlint"
brew "p7zip"
brew "grv"
brew "neovim"

casek "cakebrew"
cask "java"
cask "font-hack-nerd-font"
cask "deluge"
cask "spectacle"
cask "iterm2"
cask "alfred"
cask "caprine"
cask "sublime-text"
cask "docker"

mas "1Password", id: 443987910
mas "Slack", id: 803453959
mas "OmnitOutline", id: 1142578772
mas "OmniFocus", id: 867299399
mas "Amphetamine", id: 937984704
mas "Telegram Desktop", id: 946399090
mas "The Unarchiver", id: 425424353
mas "TweetDeck", id: 485812721
